package dictionary

// AllowInitials は特定辞書に許可されるている読み仮名を定義する
var AllowInitials = map[string][]string{
	"01-a.jsonl":  {"あ", "い", "う", "え", "お"},
	"02-ka.jsonl": {"か", "が", "き", "ぎ", "く", "ぐ", "け", "げ", "こ", "ご"},
	"03-sa.jsonl": {"さ", "ざ", "し", "じ", "す", "ず", "せ", "ぜ", "そ", "ぞ"},
	"04-ta.jsonl": {"た", "だ", "ち", "ぢ", "つ", "づ", "て", "で", "と", "ど"},
	"05-na.jsonl": {"な", "に", "ぬ", "ね", "の"},
	"06-ha.jsonl": {"は", "ば", "ぱ", "ひ", "び", "ぴ", "ふ", "ぶ", "ぷ", "へ", "べ", "ぺ", "ほ", "ぼ", "ぽ"},
	"07-ma.jsonl": {"ま", "み", "む", "め", "も"},
	"08-ya.jsonl": {"や", "ゆ", "よ"},
	"09-ra.jsonl": {"ら", "り", "る", "れ", "ろ"},
	"10-wa.jsonl": {"わ", "を", "ん"},
}
