package dictionary

// sortOrder は辞書のソート順を定義する
var sortOrder = []string{
	"あ", "ぁ", "い", "ぃ", "う", "ぅ", "え", "ぇ", "お", "ぉ",
	"か", "が", "き", "ぎ", "く", "ぐ", "け", "げ", "こ", "ご",
	"さ", "ざ", "し", "じ", "す", "ず", "せ", "ぜ", "そ", "ぞ",
	"た", "だ", "ち", "ぢ", "つ", "っ", "づ", "て", "で", "と", "ど",
	"な", "に", "ぬ", "ね", "の",
	"は", "ば", "ぱ", "ひ", "び", "ぴ", "ふ", "ぶ", "ぷ", "へ", "べ", "ぺ", "ほ", "ぼ", "ぽ",
	"ま", "み", "む", "め", "も",
	"や", "ゃ", "ゆ", "ゅ", "よ", "ょ",
	"ら", "り", "る", "れ", "ろ",
	"わ", "を", "ん",
}

// SortOrder は定義されたソート順をソートアルゴリズムで利用しやすいmapで提供する
func SortOrder() map[rune]int {
	orderMap := make(map[rune]int)

	for index, s := range sortOrder {
		r := []rune(s)
		if len(r) > 0 {
			orderMap[r[0]] = index
		}
	}

	return orderMap
}
